[{"content":"SCPFAA Handbook Articles are contributed as time permits, this is not to be considered fully finished or complete yet :) PRs are welcome if you are knowledgable, ask in Discord should you need help.\nIntroduction The SCPFAA handbook is a collection of contributed pages on how to run the podcast. We welome feedback: please make a pull request to suggest improvements or clarifications, and issues for questions.\nGeneral  About Communication  YouTube Discord Zoom   Handbook  Editing   Tools and tips  Production TODO:\n Folder heirarchy Backups Audition Photoshop Premiere Headliner  People  Guidelines  Infra TODO:\n GitHub Trello Internal Google Site  Promotion TODO: Social medias\nFinance TODO\nLegal TODO\n","date":-62135596800,"description":"","objectID":"3976528693a0108357f4928017600865","permalink":"https://scpaudioarchive.github.io/handbook/","title":"SCPFAA Handbook"},{"content":"Chatting via Discord is preferred as a starting point, and is preferred whenever possible. Synchronous audio/ video meetings can also be utilized when necessary. Again, Discord and/ or Zoom can be used.\nImportant communication Important communication should be announced in at least 2 places: the relevant Discord channel, over email lists, during a meeting, or directly, ideally on the same day. A \u0026amp;ldquo;single source of truth\u0026amp;rdquo; e.g. link to the handbook/ internal site/ site/ Google Doc should be attached.\nAway Life happens. If you need to be away for an extended period of time, please let the relevant channel know, mentioning people as relevant. Also, consider updating your nickname in Discord to reflect that (ex.: earne - Away until date).\n","date":-62135596800,"description":"","objectID":"5365f8edf28802854ee7494eb01d5ccd","permalink":"https://scpaudioarchive.github.io/handbook/communication/","title":"Communication"},{"content":"Staff have access to the THAUMIEL category. This is not open to the public and should be used when communicating internally.\n Important accouncements: #staff-chat, mention, pin General chatter: #staff-chat Off-topic: #other-chat On-topic channels can be created as needed under the THAUMIEL category  Quick meetings/ Discord-related meetings can use the staff-vc.\nStages Stages can be useful as a \u0026amp;ldquo;bridge\u0026amp;rdquo; between internal meetings and members (eg. Zoom meeting for members + open Discord stage).\nDo not use stages if:\n You need to screen share You need video (cameras) on Anyone in the Discord server should be able to freely unmute themselves  Recording meetings Discord does not offer a way to record voice/ stage channels, however, there is an audio recording bot called Craig that can be used. There is no way we\u0026amp;rsquo;re aware of to also capture go live streams and videos through Discord.\nOBS can be used to record your screen/ window and desktop audio. Keep in mind that it will record your entire screen/ Discord window, so disable capturing mouse and avoid opening text channels with sensitive information, as well as desktop audio (turn Do Not Disturb on). This can then be uploaded to YouTube.\nSharing desktop audio as well as screen TODO: Embed a YT Video detailing instructions\n","date":-62135596800,"description":"","objectID":"e86909f0f2e4d996977f8661ac5386fd","permalink":"https://scpaudioarchive.github.io/handbook/communication/discord/","title":"Discord"},{"content":"The content determines which channel it should be uploaded to:\n The main channel Internal channel  Obviously, podcast recordings must go on the main channel, as well as any videos/ livestreams that should be shared with the general audience/ subscribers.\nLivestreamed/ recorded meetings can be put on the internal channel as public unless there is a good reason for it to be private. Do not uplaod a video as unlisted.\nThere is no quality filter and videos can be embedded as necessary. If something is important enough to be put on the main channel, it can be further edited.\nTo view private internal videos, sign in to the SCPFAA internal brand account.\nAvoid linking material in the description! Instead, link or embed the video from the source.\nWe could just use Google Drive?  Longer upload times Longer to process No automatically generated subtitles Worse quality Cannot be searched Cannot be viewed publically easily  Internal channel policy  Respond to comments from the main SCPFAA channel Do not comment, subscribe to channels or watch videos Do not mark the content as \u0026amp;ldquo;for kids\u0026amp;rdquo;  Please let someone know if you come across inappropriate usage of the channel.\n","date":-62135596800,"description":"","objectID":"5a01b6901c152a3ff08680b675b227a8","permalink":"https://scpaudioarchive.github.io/handbook/communication/youtube/","title":"YouTube"},{"content":"Zoom is used when there limitations on Discord that cannot be overcome (high quality screensharing with audio on Linux, screensharing on iPad, finer meeting security settings, etc.).\nWe currently have one free account set up (free due to financial constraints). Members can join with their personal zoom accounts.\nTips  Keep the meeting link in one place (Google Calendar) instead of Docs, as it can change. If it was changed around the start of the meeting, then it is ok to have it there temporarily. Use a meeting password and keep the waiting room setting enabled. The meeting password is embedded into the join link be default. As such, be careful where you share it. It is recommended to share the meeting zoom link in the Google Calendar description, not in Docs.  Link to the Docs, or, even better, provide the Document Title.   In zoom settings, enable the following settings:  Mute all participants when they join a meeting Always show meeting control toolbar Non-verbal feedback Breakout room Closed captioning Save Captions Focus Mode    https://blog.zoom.us/keep-uninvited-guests-out-of-your-zoom-meeting/\nRecording/ Livestreaming Meetings The current process is recording, to:\n Locally record (built in to Zoom) Upload to YouTube (SCPFAA internal) as public/ private  If private, prefix the video title as such    Livestreaming can be done using OBS.\nFree account limitations  The number of total participants The meeting time if there are more than 2 participants (40 min.)  A workaround is to simply use a recurring meeting and start it again Meeting recording can be concatenated using ffmpeg and uploaded to YouTube    ","date":-62135596800,"description":"","objectID":"0f55ecbe563423c27184de02b667f8e9","permalink":"https://scpaudioarchive.github.io/handbook/communication/zoom/","title":"Zoom"},{"content":"","date":-62135596800,"description":"","objectID":"82070b26481d85e2d9d1aa31246b855b","permalink":"https://scpaudioarchive.github.io/handbook/handbook/","title":"Handbook"},{"content":"TODO: Embed a YT Video detailing instructions\n","date":-62135596800,"description":"","objectID":"5c124cb149e0e1814e8f472679d85f71","permalink":"https://scpaudioarchive.github.io/handbook/handbook/editing/","title":"Editing"},{"content":"Keep in mind that anything you do is or could be made public, for example voice/ video recording, chat messages, profile pictures, name/ nickname, etc. You may want to create seprarate account(s) to interact with the SCPFAA podcast/ members.\n","date":-62135596800,"description":"","objectID":"528b8e969ad0e19b4d19adbf0d49b590","permalink":"https://scpaudioarchive.github.io/handbook/people/guidelines/","title":"Guidelines"},{"content":"Google Drive Due to financial reasons, we currently are not part of a Google workspace. This may change in the future, though. For now, we work off of personal Google accounts. If you don\u0026amp;rsquo;t have one, or you want a separate name/ identity to be associated, please create one.\nWith regards to storage, if you are concerned about storage quotas, please have me create/ upload the file under the primary account so it won\u0026amp;rsquo;t count against your quota. We will investigate a selfhosted Nextcloud instance for large files that are not documents/ spreadsheets/ presentations etc.\n Avoid linking directly to Google Drive/ Apps  Consdier including the name of the file so members can search for it in Google Drive. If you link directly to the URL, unadded people can request access.   Keep it organized  ","date":-62135596800,"description":"","objectID":"46a1e557fc45ba18f82ac63e2a5c7d5b","permalink":"https://scpaudioarchive.github.io/handbook/tools-and-tips/","title":"Tools and Tips"}]